#모스부호 해독

dic = {
    '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z'
}

input = ".... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--"
def morseCode(s):
    output = []
    for i in s.split("  "):
        for j in i.split(" "):
            output.append(dic[j])
        output.append(" ")
    print("".join(output))

morseCode(input)
